04unsteadyNS/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          40;
        startFace       7860;
    }
    outlet
    {
        type            patch;
        nFaces          40;
        startFace       7900;
    }
    down
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       7940;
    }
    up
    {
        type            empty;
        inGroups        1(empty);
        nFaces          4000;
        startFace       11940;
    }
    sides
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       15940;
    }
)

// ************************************************************************* //
