04unsteadyNS/0/Ulift0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      Ulift0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
4000
(
(1 2.49917e-10 0)
(1 4.94506e-11 0)
(1 8.81665e-11 0)
(1 8.11778e-11 0)
(1 -1.18948e-12 0)
(1 -4.51534e-11 0)
(1 -8.60876e-11 0)
(1 -1.39326e-10 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    down
    {
        type            empty;
    }
    up
    {
        type            empty;
    }
    sides
    {
        type            slip;
    }
}


// ************************************************************************* //
